artilleryposttest.yaml
config:
  target: "http://localhost:3001"
  http: 
    timeout: 10 # Responses have to be sent within 10 seconds or the request will be aborted

  phases:
    - duration: 1
      arrivalRate: 2
      name: "1 to 10"

  variables:
    gameids:
      - "1"
      - "10"
      - "100"
      - "1000"
      - "10000"
      - "100000"
      - "1000000"
      - "10000000"


  payload:
    # path is relative to the location of the test script
    path: "./artillerydata.csv"
    fields:
      - "gameid"

scenarios:
  - name: "Stress Test GET"
    flow:
      - get:
          url: "/api/description/{{gameids}}"